<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"fc638fc32653a74a0bbefb0d16fabc9df6a1bf048299362e0f4dc43cad91dc14","plan_job_ref":"Job Pull Request Checks #1006 at https://github.com/GSA-TTS/FAC/actions/runs/6251424136","plan_hash":"57af68015fa682513d0687408d93e2a57414b539e94c19dba2123f5af5a6bad1","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.postgrest will be updated in-place
  ~ resource "cloudfoundry_app" "postgrest" {
      ~ environment                     = (sensitive value)
        id                              = "5de6f04c-52e0-400f-961a-16243b1c7c9a"
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "postgrest"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_service_key.postgrest will be created
  + resource "cloudfoundry_service_key" "postgrest" {
      + credentials      = (sensitive value)
      + id               = (known after apply)
      + name             = "postgrest"
      + service_instance = (known after apply)
    }

  # module.dev.module.database.cloudfoundry_service_instance.rds will be created
  + resource "cloudfoundry_service_instance" "rds" {
      + id                             = (known after apply)
      + name                           = "fac-db"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
      + space                          = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.dev.module.database.cloudfoundry_service_instance.rds,
  on /tmp/terraform-data-dir/modules/dev.database/database/main.tf line 14, in resource "cloudfoundry_service_instance" "rds":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 2 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #1006](https://github.com/GSA-TTS/FAC/actions/runs/6251424136)